go_string_packages.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-11 Sat 02:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Go: String-related packages</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pavel Vavilin" />
<meta name="keywords" content="Go unicode" />
<link rel="stylesheet" type="text/css" href="solarized-dark.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://pimiento.github.io/"> UP </a>
 |
 <a accesskey="H" href="https://pimiento.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">Go: String-related packages</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9d1f253">1. Strings</a></li>
<li><a href="#org0696f7f">2. Strconv</a></li>
<li><a href="#org358a064">3. Utf8 and the unicode</a></li>
<li><a href="#org7e1055d">4. Regexp</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9d1f253" class="outline-2">
<h2 id="org9d1f253"><span class="section-number-2">1</span> <a href="https://golang.org/pkg/strings/">Strings</a></h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>strings.Split example</label><pre class="src src-go">names := <span style="color: #ffa500;">"Niccol&#242;&#8226;No&#235;l&#8226;Geoffrey&#8226;Am&#233;lie&#8226;&#8226;Turlough&#8226;Jos&#233;"</span>
fmt.<span style="color: #00ffff; font-weight: bold;">Print</span>(<span style="color: #ffa500;">"|"</span>)
<span style="color: #00ff00; font-weight: bold;">for</span> _, name := <span style="color: #00ff00; font-weight: bold;">range</span> strings.<span style="color: #00ffff; font-weight: bold;">Split</span>(names, <span style="color: #ffa500;">"&#8226;"</span>) {
fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%s|"</span>, name)
}
fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>()
</pre>
</div>

<pre class="example">
|Niccolò|Noël|Geoffrey|Amélie||Turlough|José|

</pre>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>strings.FieldsFunc example</label><pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">for</span> _, record := <span style="color: #00ff00; font-weight: bold;">range</span> []<span style="color: #00ffff;">string</span>{
        <span style="color: #ffa500;">"L&#225;szl&#243; Lajtha*1892*1963"</span>,
        <span style="color: #ffa500;">"&#201;douard Lalo\t1823\t1892"</span>,
        <span style="color: #ffa500;">"Jos&#233; &#193;ngel Lamas|1775|1814"</span>} {
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(strings.<span style="color: #00ffff; font-weight: bold;">FieldsFunc</span>(record, <span style="color: #00ff00; font-weight: bold;">func</span>(char <span style="color: #00ffff;">rune</span>) <span style="color: #00ffff;">bool</span> {
                        <span style="color: #00ff00; font-weight: bold;">switch</span> char {
                        <span style="color: #00ff00; font-weight: bold;">case</span> <span style="color: #ffa500;">'\t'</span>, <span style="color: #ffa500;">'*'</span>, <span style="color: #ffa500;">'|'</span>:
                                <span style="color: #00ff00; font-weight: bold;">return</span> <span style="color: #7fffd4;">true</span>
                        }
                        <span style="color: #00ff00; font-weight: bold;">return</span> <span style="color: #7fffd4;">false</span>
                }))
        }
</pre>
</div>

<pre class="example">
[László Lajtha 1892 1963]
[Édouard Lalo 1823 1892]
[José Ángel Lamas 1775 1814]

</pre>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>strings.Replace example</label><pre class="src src-go">names := <span style="color: #ffa500;">" Ant&#244;nio\tAndr&#233;\tFriedrich\t\t\tJean\t\t&#201;lisabeth\tIsabella \t"</span>
names = strings.<span style="color: #00ffff; font-weight: bold;">Replace</span>(names, <span style="color: #ffa500;">"\t"</span>, <span style="color: #ffa500;">" "</span>, -1)
fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"|%s|\n"</span>, names)
</pre>
</div>

<pre class="example">
| Antônio André Friedrich   Jean  Élisabeth Isabella  |

</pre>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>strings.Map example</label><pre class="src src-go">asciiOnly := <span style="color: #00ff00; font-weight: bold;">func</span>(char <span style="color: #00ffff;">rune</span>) <span style="color: #00ffff;">rune</span> {
        <span style="color: #00ff00; font-weight: bold;">if</span> char &gt; 127 {
                <span style="color: #00ff00; font-weight: bold;">return</span> <span style="color: #ffa500;">'?'</span>
        }
        <span style="color: #00ff00; font-weight: bold;">return</span> char
}
fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(strings.<span style="color: #00ffff; font-weight: bold;">Map</span>(asciiOnly, <span style="color: #ffa500;">"J&#233;r&#244;me &#214;sterreich"</span>))
</pre>
</div>

<pre class="example">
J?r?me ?sterreich

</pre>
</div>
</div>

<div id="outline-container-org0696f7f" class="outline-2">
<h2 id="org0696f7f"><span class="section-number-2">2</span> <a href="https://golang.org/pkg/strconv/">Strconv</a></h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>strconv.ParseBool example</label><pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">for</span> _, truth := <span style="color: #00ff00; font-weight: bold;">range</span> []<span style="color: #00ffff;">string</span>{<span style="color: #ffa500;">"1"</span>, <span style="color: #ffa500;">"t"</span>, <span style="color: #ffa500;">"TRUE"</span>, <span style="color: #ffa500;">"false"</span>, <span style="color: #ffa500;">"F"</span>, <span style="color: #ffa500;">"0"</span>, <span style="color: #ffa500;">"5"</span>} {
        <span style="color: #00ff00; font-weight: bold;">if</span> b, err := strconv.<span style="color: #00ffff; font-weight: bold;">ParseBool</span>(truth); err != <span style="color: #7fffd4;">nil</span> {
                fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"\n{%v}"</span>, err)
        } <span style="color: #00ff00; font-weight: bold;">else</span> {
                fmt.<span style="color: #00ffff; font-weight: bold;">Print</span>(b, <span style="color: #ffa500;">" "</span>)
        }
}
</pre>
</div>

<pre class="example">
true true true false false false
{strconv.ParseBool: parsing "5": invalid syntax}

</pre>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span>strconv.FormatInt examples</label><pre class="src src-go">i := 16769023
fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(strconv.<span style="color: #00ffff; font-weight: bold;">Itoa</span>(i))
fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(strconv.<span style="color: #00ffff; font-weight: bold;">FormatInt</span>(<span style="color: #00ffff; font-weight: bold;">int64</span>(i), 10))
fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(strconv.<span style="color: #00ffff; font-weight: bold;">FormatInt</span>(<span style="color: #00ffff; font-weight: bold;">int64</span>(i), 2))
fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(strconv.<span style="color: #00ffff; font-weight: bold;">FormatInt</span>(<span style="color: #00ffff; font-weight: bold;">int64</span>(i), 16))
</pre>
</div>

<pre class="example">
16769023
16769023
111111111101111111111111
ffdfff

</pre>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 7: </span>strconv.Quote example</label><pre class="src src-go">s := <span style="color: #ffa500;">"Alle &#248;nsker &#229; v&#230;re fri."</span>
quoted := strconv.<span style="color: #00ffff; font-weight: bold;">Quote</span>(s)
fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(quoted)
fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(strconv.<span style="color: #00ffff; font-weight: bold;">Unquote</span>(quoted))
</pre>
</div>

<pre class="example">
Alle ønsker å være fri.

</pre>
</div>
</div>

<div id="outline-container-org358a064" class="outline-2">
<h2 id="org358a064"><span class="section-number-2">3</span> <a href="https://golang.org/pkg/unicode/utf8/">Utf8</a> and the <a href="https://golang.org/pkg/unicode/utf8/">unicode</a></h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>The <b>unicode/utf8</b> package provides several useful functions for querying and manipulating strings and []byte s which hold UTF-8 bytes.</li>
<li>The <b>unicode</b> package provides functions for querying Unicode code points to determine if they meet certain criteria—for example, whether the character they represent is a digit or a lowercase letter.</li>
</ul>
</div>
</div>

<div id="outline-container-org7e1055d" class="outline-2">
<h2 id="org7e1055d"><span class="section-number-2">4</span> <a href="https://golang.org/pkg/regexp/">Regexp</a></h2>
<div class="outline-text-2" id="text-4">
<p>
The regexp package is a Go implementation of Russ Cox’s <a href="http://code.google.com/p/re2/">RE2</a> regular expression engine. ✪ This engine is fast and thread-safe. The <a href="http://code.google.com/p/re2/">RE2</a> engine doesn’t use backtracking, so guarantees linear time execution \(O(n)\) where \(n\) is the length of the matched string, whereas backtracking engines can easily take exponential time \(O(2)\). The superior performance is gained at the expense of having no support for backreferences in searches.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pavel Vavilin</p>
<p class="date">Created: 2017-11-11 Sat 02:59</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
